0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet1
    {
    type                freestreamPressure;
    freestreamValue     uniform 100000;
    value               uniform 100000;
    }     

    outlet1
    {
        type            fixedValue;
	    value 		    uniform 200000;  // pb/pi = 2
    }
    outlet2
    {
        type            zeroGradient;
    }

    "(wall1|wall2).*"
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            symmetryPlane;
    }
    
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
